export default (function () {
  var locales = {}

  locales.id = 'zh_CN'

  // data-time formats
  locales.DATETIME_FORMATS = {
    TITLE: ['年', '月', '日'],
    MONTH: [
      '1月',
      '2月',
      '3月',
      '4月',
      '5月',
      '6月',
      '7月',
      '8月',
      '9月',
      '10月',
      '11月',
      '12月'
    ],
    SHORTMONTH: [
      '1月',
      '2月',
      '3月',
      '4月',
      '5月',
      '6月',
      '7月',
      '8月',
      '9月',
      '10月',
      '11月',
      '12月'
    ],
    DAY: ['星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六'],
    SHORTDAY: ['周日', '周一', '周二', '周三', '周四', '周五', '周六'],
    AMPMS: ['上午', '下午'],
    medium: 'yyyy-M-d ah:mm:ss',
    short: 'yy-M-d ah:mm',
    fullDate: 'y年M月d日EEEE',
    longDate: 'y年M月d日',
    mediumDate: 'yyyy-M-d',
    shortDate: 'yy-M-d',
    mediumTime: 'ah:mm:ss',
    shortTime: 'ah:mm'
  }

  // number formats
  locales.NUMBER_FORMATS = {
    DECIMAL_SEP: '.',
    GROUP_SEP: ',',
    PATTERNS: [
      {
        minInt: 1,
        minFrac: 0,
        maxFrac: 3,
        posPre: '',
        posSuf: '',
        negPre: '-',
        negSuf: '',
        gSize: 3,
        lgSize: 3
      },
      {
        minInt: 1,
        minFrac: 2,
        maxFrac: 2,
        posPre: '\u00A4',
        posSuf: '',
        negPre: '\u00A4-',
        negSuf: '',
        gSize: 3,
        lgSize: 3
      }
    ],
    CURRENCY_SYM: '¥'
  }

  /**
   * fields/messages for example $field('xxxx')/$msg('xxxx') or
   * $locale.FIELDS.xxxx/$locale.MESSAGES.xxxx
   */
  let fields = {}
  let messages = {}
  locales.FIELDS = fields
  locales.MESSAGES = messages
  // 货币转换
  messages['Currency'] = {
    AUD: '澳大利亚元',
    CAD: '加拿大元',
    CHF: '瑞士法郎',
    CNY: '人民币',
    EUR: '欧元',
    GBP: '英镑',
    HKD: '港币',
    JPY: '日元',
    NZD: '新西兰元',
    SEK: '瑞典克郎',
    SGD: '新加坡元',
    USD: '美元'
  }
  // 证件类型
  messages['idCard'] = {
    '00': '居民身份证',
    '01': '临时身份证',
    '03': '军人身份证',
    '04': '武警身份证',
    '05': '护照',
    '06': '港澳居民往来内地通行证/回乡证',
    '07': '台湾居民往来内地通行证',
    '08': '其他身份证明文件(个人)'
  }
  // 个人用途
  messages['FundUsage1'] = {
    '101': '工资',
    '102': '奖金',
    '103': '劳务费',
    '104': '报销款',
    '105': '货款'
  }
  // 企业用途
  messages['FundUsage2'] = {
    '201': '货款',
    '202': '往来款',
    '203': '合同款',
    '204': '材料费',
    '205': '工程款',
    '206': '投资款',
    '207': '采购款',
    '208': '社保金',
    '209': '公积金',
    '210': '咨询费',
    '211': '差旅费',
    '212': '其他'
  }
  messages['BankAcType'] = {
    '01': '活期一本通',
    '02': '活期',
    '03': '借记卡',
    '04': '信用卡',
    '20': '定期一本通'
  }

  /* message send state */
  messages['SendState'] = {
    '1': '已发送',
    '9': '待发送'
  }

  /* message check state */
  messages['ActivityAuthState'] = {
    '0': '待审核',
    '1': '审核中',
    '2': '审核未通过',
    '3': '待发送',
    '4': '未发送',
    '5': '已发送'
  }

  /* 活动管理-活动消息状态 */
  messages['ActivityMsgQryState'] = {
    '1': '审核中',
    '2': '审核未通过',
    '4': '待发送',
    '5': '已发送'
  }

  /* order classification */
  messages['CashFlag'] = {
    'C': '钞',
    'T': '汇'
  }

  messages['CertificateType'] = {
    '1': '身份证',
    '2': '营业执照证书'
  }

  /* 性别 */
  messages['Sex'] = {
    '1': '男',
    '2': '女'
  }

  messages['JniState'] = {// 流水状态
    'C': '成功',
    'F': '失败',
    'I': '未开始',
    'U': '未明',
    'M': '处理中'
  }
  messages['ProcessState'] = { // 处理状态
    'WCK': '待复核',
    'WAH': '待授权',
    'WAP': '待审批',
    'FL': '失败',
    'OK': '成功',
    'UC': '未确定状态',
    'RJ': '拒绝',
    'CC': '取消',
    'RC': '退回',
    'BSC': '已作废',
    'TMR': '预约生效'
  }
  messages['MgmtPrdFlag'] = { // 交易类型
    '0': '金融类交易审核',
    '2': '管理类交易审核'
  }
  messages['acctStatus'] = { // 账户状态
    'A': '活动',
    'C': '销户',
    'D': '睡眠',
    'E': '没收',
    'I': '非活动',
    'N': '新开'
  }
  messages['TaskProcessType'] = { // 授权状态
    'AG': '同意',
    'RJ': '拒绝',
    'RC': '退回',
    'CC': '取消',
    'WT': '待复核授权'
  }
  messages['OpType'] = { // 任务操作类型
    'C': '复核',
    'A': '授权',
    'R': '发送'
  }
  messages['PartyType'] = { // 任务操作人员类型
    'U': '指定用户',
    'G': '用户组别',
    'D': '指定部门',
    'P': '指定机构'
  }

  messages['FundUsage1'] = {
    '101': '工资',
    '102': '奖金',
    '103': '劳务费',
    '104': '报销款',
    '105': '货款'
  }
  messages['FundUsage2'] = {
    '201': '货款',
    '202': '往来款',
    '203': '合同款',
    '204': '材料费',
    '205': '工程款',
    '206': '投资款',
    '207': '采购款',
    '208': '社保金',
    '209': '公积金',
    '210': '咨询费',
    '211': '差旅费',
    '212': '其他'
  }

  messages['ReverseStatus'] = {
    'S': '交易成功',
    'H': '执行中',
    'U': '待执行'
  }

  messages['AcctStatus'] = {
    'A': '活动',
    'C': '销户',
    'D': '睡眠',
    'E': '没收',
    'I': '非活动',
    'N': '新开'
  }
  // 操作员状态
  messages['OperatorStatus'] = {
    'N': '正常',
    'C': '销户',
    'L': '锁定',
    'U': '待激活',
    'F': '冻结',
    'S': '停用'
  }
  messages['AccType'] = {
    ESAV: '企业基本户',
    ENDA: '企业通知存款账户',
    ERMY: '企业一般户',
    ETMP: '企业临时户',
    ESPL: '企业专用户'
  }
  // 证书状态
  messages['CertStatus'] = {
    'N': '正常',
    'C': '吊销',
    'U': '未下载',
    'F': '冻结',
    'Z': '申请未下载',
    'X': '恢复未下载',
    'M': '更新未下载',
    'A': '激活'
  }
  // 活转定续存类型
  messages['AutoRenewRollover'] = {
    'O': '本息续存',
    'W': '本金续存',
    'N': '不续存'
  }
  // 回单类型
  messages['RecptType'] = {
    '1': '收款回单',
    '2': '付款回单',
    '3': '存款利息回单',
    '4': '贷款还款回单',
    '5': '其他业务回单'
  }
  // 操作级别
  messages['MgmtAuth'] = {
    '1': '一级',
    '2': '二级',
    '3': '三级'
  }
  // 合同签订状态
  messages['ContractStatus'] = {
    '0': '未签订',
    '1': '已签订',
    '3': '失效'
  }
  // 批量代发 0-未处理,1-处理成功,2-处理失败,3-处理中'
  messages['BatPollStatus'] = {
    '0': '未处理',
    '1': '处理成功',
    '2': '处理失败',
    '3': '处理中'
  }
  // 批量转账
  messages['BatTranStatus'] = {
    '1': '已处理',
    '0': '处理中'
  }
  // 对账状态
  messages['Chkflag'] = {
    '1': '已对账',
    '0': '未对账'
  }
  // 对账状态
  messages['loanType'] = {
    '0': '流动资金贷款',
    '1': '银行承兑汇票',
    '2': '信用证'
  }
  // 融资供应链证件类型
  messages['DocumentType'] = {
    '0': '组织机构代码',
    '1': '二代身份证',
    '2': '军官证',
    '3': '护照',
    '4': '其他',
    '5': '三证合一'
  }
  // 受托支付状态
  messages['trustPayStatus'] = {
    '0': '待审核',
    '1': '银行处理中',
    '2': '银行审核通过',
    '3': '银行审核不通过'
  }
  // 借贷标识
  messages['drcrflag'] = {
    'C': '贷记',
    'D': '借记'
  }
  // 账户性质
  messages['Acctnature'] = {
    '3': '一般户',
    '4': '基本户',
    '5': '临时户',
    '6': '转用户'
  }

  // 提款方式
  messages['LoanType'] = {
    '0': '流动资金贷款',
    '1': '银行承兑汇票',
    '2': '信用证'
  }
  // 受托支付
  messages['TrustPayIdea'] = {
    '0': '否',
    '1': '是'
  }
  // 新的证件类型
  messages['NewIdType'] = {
    '000': '未知',
    '100': '个人',
    '101': '居民身份证',
    '102': '居民户口簿',
    '103': '外国护照',
    '112': '中国护照',
    '105': '军官证',
    '106': '士兵证',
    '107': '武警军官证',
    '113': '武警士兵证',
    '108': '港澳居民来往内地通行证（香港）',
    '114': '港澳居民来往内地通行证（澳门）',
    '109': '台湾居民来往大陆通行证',
    '116': '台湾居民旅行证',
    '110': '临时居民身份证',
    '111': '外国人居留证',
    '115': '边民出入境通行证',
    '199': '其他个人证件',
    '200': '法人',
    '201': '法人',
    '202': '民办非企业登记证书',
    '203': '外国（地区）企业常驻代表机构登记证',
    '204': '社会团体法人登记证书',
    '205': '事业单位法人证书',
    '206': '组织机构代码证',
    '207': '税务登记证（国税）',
    '208': '税务登记证（地税）',
    '209': '开户许可证',
    '210': '经营外汇业务许可证',
    '211': '金融许可证',
    '212': '经营保险业务许可证',
    '213': '经营证券业务许可证',
    '214': '进出口经营权许可证书',
    '215': '外商企业投资登记证书',
    '216': '经营期货业务许可证',
    '218': '机构编制管理证',
    '219': '中信虚拟组织机构代码',
    '220': 'SWIFT代码',
    '221': '券商编号',
    '222': '期货公司机构编号',
    '223': '保险公司编号',
    '998': '其他'
  }
  // 提款进度状态
  messages['TrustPayStatus'] = {
    '2': '银行处理成功',
    '1': '银行处理中',
    '0': '银行处理失败',
    '3': '银行已退回'
  }
  // 融资进度查询处理状态
  messages['LoanIdeaStatus'] = {
    '0': '未受理',
    '1': '已受理',
    '2': '已退回',
    '3': '授信审批通过',
    '4': '授信审批未通过',
    '5': '未分发'
  }

  messages['rcvbStatus'] = {
    '0': '已质押',
    '1': '已转让',
    '2': '已销账',
    '3': '已质押解除'
  }
  // 付款条件
  messages['payCondition'] = {
    '0': '发票日后付款',
    '1': '验货日后付款'
  }
  // 但据类型
  messages['invoiceType'] = {
    '0': '订单',
    '1': '结算单',
    '2': '发票',
    '3': '付款承诺',
    '4': '其他'
  }

  return locales
})()
